#!/bin/bash
# Выводит бесконечный поток символов *, основан на tput
clear                                                                       # Очистка экрана
tput init                                                                   # Инициация tput
tput hc 0                                                                   # Код выхода если перед нами hard copy терминал
tput sc                                                                     # Сохраняем текущую позицию курсора
tput civis                                                                  # Делаем курсор невидимым
tput setf 2                                                                 # Устанавливаем цвет шрифта - зелёный
tput setb 7                                                                 # Устанавливаем цвет фона - белый
while true                                                                  # "Вечная" истина создаёт бесконечный цикл 
do                            
tput cup $(shuf -i 1-$(tput lines) -n 1) $(shuf -i 1-$(tput cols) -n 1)     # Выводим символ * на позиуии с случайными координатами
                                                                            # Случайные координаты генерируем shuf -i интервал -n 1
                                                                            # Верхнюю границу интервалов получаем из параметров терминала
echo "*"
done
tput rc                                                                     # Возвращаем сохранённое состояние курсора
tput srg0                                                                   # Сбрасываем настройки цвета

